files/wiki/org/programming.org
#+TITLE: programming languages
#+SETUPFILE: ../style/default.setup

* Python

** Short notes on Python programming

~meshgrid~ :: ~meshgrid~ is a convenient command to general coordinates for multidimensional images. A tricky part about this function is the dimension of the generated arrays. Compare the following two commands:

#+begin_src python :results output pp :exports both
import numpy as np
X = np.meshgrid(np.arange(0,5), np.arange(0,4))[0]
print(X)
print(X.shape)
print(np.meshgrid(np.arange(0,5), np.arange(0,4), np.arange(0,3))[0].shape)
#+end_src

#+RESULTS:
: [[0 1 2 3 4]
:  [0 1 2 3 4]
:  [0 1 2 3 4]
:  [0 1 2 3 4]]
: (4, 5)
: (4, 5, 3)

** Tips

  - To make a parameter into a list, use ~ensure_list(x)~?

  - pdb: add breakpoints in another file:

    ~import sys;~

    ~sys.path.append(module)~

  - Add a .py or .pyc file to ~/.ipython/profile_default/startup/ and it will be excuted every time you start up ipython

** Deepthought2

*** What I did

  1. Created ~/.mypython, ~/.mypython/lib, ~/.mypython/lib/python
  2. Installed PYMSES in ~/.mypython/lib/python/pymses_4.0.0
  3. Added the following to my .cshrc.mine file

#+begin_src python
setenv PYTHONPATH ~/.mypython/lib/python
setenv PYTHONPATH ~/.mypython/lib/python/pymses_4.0.0:$PYTHONPATH
setenv PATH ${PATH}:~/.mypython/lib/python/pymses_4.0.0/bin
#+end_src

  4. Installed mpi4pi in ~/.mypython (results in lib/python/)

     #+begin_src shell
       cd ~/.mypython/mpi4py-2.0.0
       python setup.py install --home ~/.mypython
     #+end_src

  5. Installed anaconda2 but it's not the default enviroment. To
     activate it, do `exec bash1` and `source ~/.cshrc.local.python`. Some .bash files have that code in it, e.g. _~/lustre/Sam/work/profilePlot.bash

*** Installing modules yourself

  Following https://www.glue.umd.edu/hpcc/help/software/python.html

  The mechanism for installing a module is of course dependent on the module being installed, but most modern python modules support the `setup.py` mechanism described below. Assuming that is the case, the standard procedure for installing your own copy of a module is:

  1. `module load python/X.Y.Z` to select the version of python you wish to use.
  2. Create a directory to contain your python module, if not already done. Typically, you will want one directory to house all of the modules you are installing, so something like `mkdir ~/.mypython` will work. You should also create `lib` and `lib/python` directories beneath it, e.g. `mkdir ~/.mypython/lib ~/.mypython/lib/python`.
  3. You will need to tell python where to look for your modules. Assuming you are putting your modules under `~/.mypython`, something like `setenv PYTHONPATH ~/.mypython/lib/python` (bash/bourne shell users should do `PYTHONPATH=~/.mypython/lib/python; export PYTHONPATH `). You probably want to add this to your `.cshrc.mine` or `.bashrc.mine`.
  4. Download and unzip/untar/etc the module sources. Cd to the main module source directory (it should contain the file `setup.py`
  5. Run `python setup.py install --home ~/.mypython`

  If all goes well, the module should now be installed under `~/.mypython` or wherever you specified. If there are executables associated with it, they should be in `~/.mypython/bin`. You should be able to import the module in python now (this assumes that PYTHONPATH is set as indicated above).

  Of course, not all modules install easily. Unfortunately, the install process can fail in far too many ways than can be reasonably enumerated. If you are comfortable with building modules, you might find reasonable guidance from error messages to assist you in getting the module to build, but it is probably easiest to just request the module be installed to the system libraries.

  ## PEP 8 -- Style Guide for Python Code

  - Class names should normally use the CapWords convention.
  - Function names should be lowercase, with words separated by underscores as necessary to improve readability.
  - Variable names follow the same convention as function names.
  - Method Names and Instance Variables: Use the function naming rules
    - Use one leading underscore only for non-public methods and instance variables.
  - Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include `MAX_OVERFLOW` and `TOTAL`.

  ## Mallecious

  Update Spyder: ~pip install -U spyder~

  An environment for Python 3.5 installed along with Python 2 by

  #+begin_src shell
    conda create -n py35 python=3.5 anaconda
  #+end_src

  To activate this environment, type `source activate py35`; to deactivate, use `source deactivate`.
  The enviroment path is on */startrek/chongchong/anaconda2/envs/py35/bin/python*.

*** MPI4PY

**** Solution to a problem

  <https://stackoverflow.com/questions/44573568/mpirun-doesnt-work-and-ask-to-change-tmpdir-variable-to-tmp>

 #+begin_src shell
   export TMPDIR=/tmp
 #+end_src

** Plotting
*** plotutils.py
**** What does it do?
  - Set figure size to make the lines and texts larger
  - Set font size, including texts, ticks, etc
  - Useful function like set_plot_style, sized_figure_new, etc

**** How to use?
  - ~import plotutils~
  - Use the following methods to enable latex and serif style
    - ~pu.set_plot_style(0)~
    - Put a ~-l~ in argv, e.g. ~python main.py -l~

