files/wiki/public/programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-27 Mon 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>programming languages</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChongChong He" />
<link rel="stylesheet" href="css/org.css" type="text/css" />
<link rel="stylesheet" href="css/custom.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">programming languages</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2edf8d3">Python</a>
<ul>
<li><a href="#orgee23062">Short notes on Python programming</a></li>
<li><a href="#orgbf65b29">Tips</a></li>
<li><a href="#org6b3b8fd">Deepthought2</a>
<ul>
<li><a href="#orge547838">What I did</a></li>
<li><a href="#org1e34578">Installing modules yourself</a></li>
<li><a href="#orga353a55">MPI4PY</a></li>
</ul>
</li>
<li><a href="#org8178acd">Plotting</a>
<ul>
<li><a href="#org0dd09c0">plotutils.py</a></li>
<li><a href="#org808fc6c">color palettes (in Seaborn)</a></li>
<li><a href="#orga68a4d2">SciencePlot</a></li>
</ul>
</li>
<li><a href="#org047f6e8">Miscellaneous</a>
<ul>
<li><a href="#orgb082cf5">Split pdf files</a></li>
</ul>
</li>
<li><a href="#org5e52cde">PyLint</a>
<ul>
<li><a href="#orgea939b7">Documentation</a></li>
<li><a href="#org89da05a">.pylintrc</a></li>
</ul>
</li>
<li><a href="#org80fe79f">Cython</a>
<ul>
<li><a href="#orgb74238a">Example: primes.pyx</a></li>
</ul>
</li>
<li><a href="#org3ad6308">iPython tricks</a></li>
<li><a href="#orgadbc810">Jupyter</a>
<ul>
<li><a href="#org7125789">Configurations</a></li>
<li><a href="#orgb2bee6b">Tips</a></li>
<li><a href="#org9473ab4">Edit python notebooks over SSH</a></li>
<li><a href="#org52b95b9">Add kernel to jupyter</a></li>
</ul>
</li>
<li><a href="#orgd5d757d">Web</a>
<ul>
<li><a href="#org2512325">Downloading files from web using Python</a></li>
</ul>
</li>
<li><a href="#org0853eec">Logging</a>
<ul>
<li><a href="#orgb7016a2">Try logging into file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2edf8d3" class="outline-2">
<h2 id="org2edf8d3">Python</h2>
<div class="outline-text-2" id="text-org2edf8d3">
</div>
<div id="outline-container-orgee23062" class="outline-3">
<h3 id="orgee23062">Short notes on Python programming</h3>
<div class="outline-text-3" id="text-orgee23062">
<p>
<code>meshgrid</code> :: <code>meshgrid</code> is a convenient command to general coordinates for multidimensional images. A tricky part about this function is the dimension of the generated arrays. Compare the following two commands:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e45649;">import</span> numpy <span style="color: #e45649;">as</span> np
<span style="color: #e45649;">print</span>(np.meshgrid(np.arange(0,5), np.arange(0,4))[0].shape)
<span style="color: #e45649;">print</span>(np.meshgrid(np.arange(0,5), np.arange(0,4), np.arange(0,3))[0].shape)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbf65b29" class="outline-3">
<h3 id="orgbf65b29">Tips</h3>
<div class="outline-text-3" id="text-orgbf65b29">
<ul class="org-ul">
<li>To make a parameter into a list, use <code>ensure_list(x)</code>?</li>

<li><p>
pdb: add breakpoints in another file:
</p>

<p>
<code>import sys;</code>
</p>

<p>
<code>sys.path.append(module)</code>
</p></li>

<li>Add a .py or .pyc file to ~/.ipython/profile_default/startup/ and it will be excuted every time you start up ipython</li>
</ul>
</div>
</div>

<div id="outline-container-org6b3b8fd" class="outline-3">
<h3 id="org6b3b8fd">Deepthought2</h3>
<div class="outline-text-3" id="text-org6b3b8fd">
</div>
<div id="outline-container-orge547838" class="outline-4">
<h4 id="orge547838">What I did</h4>
<div class="outline-text-4" id="text-orge547838">
<ol class="org-ol">
<li>Created ~/.mypython, ~/.mypython/lib, ~/.mypython/lib/python</li>
<li>Installed PYMSES in ~/.mypython/lib/python/pymses_4.0.0</li>
<li>Added the following to my .cshrc.mine file</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">setenv PYTHONPATH ~/.mypython/lib/python
setenv PYTHONPATH ~/.mypython/lib/python/pymses_4.0.0:$PYTHONPATH
setenv PATH ${PATH}:~/.mypython/lib/python/pymses_4.0.0/<span style="color: #a626a4;">bin</span>
</pre>
</div>

<ol class="org-ol">
<li><p>
Installed mpi4pi in ~/.mypython (results in lib/python/)
</p>

<div class="org-src-container">
<pre class="src src-shell">       <span style="color: #a626a4;">cd</span> ~/.mypython/mpi4py-2.0.0
       python setup.py install --home ~/.mypython
</pre>
</div></li>

<li>Installed anaconda2 but it's not the default enviroment. To
activate it, do `exec bash1` and `source ~/.cshrc.local.python`. Some .bash files have that code in it, e.g. _~/lustre/Sam/work/profilePlot.bash</li>
</ol>
</div>
</div>

<div id="outline-container-org1e34578" class="outline-4">
<h4 id="org1e34578">Installing modules yourself</h4>
<div class="outline-text-4" id="text-org1e34578">
<p>
Following <a href="https://www.glue.umd.edu/hpcc/help/software/python.html">https://www.glue.umd.edu/hpcc/help/software/python.html</a>
</p>

<p>
The mechanism for installing a module is of course dependent on the module being installed, but most modern python modules support the `setup.py` mechanism described below. Assuming that is the case, the standard procedure for installing your own copy of a module is:
</p>

<ol class="org-ol">
<li>`module load python/X.Y.Z` to select the version of python you wish to use.</li>
<li>Create a directory to contain your python module, if not already done. Typically, you will want one directory to house all of the modules you are installing, so something like `mkdir ~/.mypython` will work. You should also create `lib` and `lib/python` directories beneath it, e.g. `mkdir ~/.mypython/lib ~/.mypython/lib/python`.</li>
<li>You will need to tell python where to look for your modules. Assuming you are putting your modules under `~/.mypython`, something like `setenv PYTHONPATH ~/.mypython/lib/python` (bash/bourne shell users should do `PYTHONPATH=~/.mypython/lib/python; export PYTHONPATH `). You probably want to add this to your `.cshrc.mine` or `.bashrc.mine`.</li>
<li>Download and unzip/untar/etc the module sources. Cd to the main module source directory (it should contain the file `setup.py`</li>
<li>Run `python setup.py install &#x2013;home ~/.mypython`</li>
</ol>

<p>
If all goes well, the module should now be installed under `~/.mypython` or wherever you specified. If there are executables associated with it, they should be in `~/.mypython/bin`. You should be able to import the module in python now (this assumes that PYTHONPATH is set as indicated above).
</p>

<p>
Of course, not all modules install easily. Unfortunately, the install process can fail in far too many ways than can be reasonably enumerated. If you are comfortable with building modules, you might find reasonable guidance from error messages to assist you in getting the module to build, but it is probably easiest to just request the module be installed to the system libraries.
</p>

<p>
## PEP 8 &#x2013; Style Guide for Python Code
</p>

<ul class="org-ul">
<li>Class names should normally use the CapWords convention.</li>
<li>Function names should be lowercase, with words separated by underscores as necessary to improve readability.</li>
<li>Variable names follow the same convention as function names.</li>
<li>Method Names and Instance Variables: Use the function naming rules
<ul class="org-ul">
<li>Use one leading underscore only for non-public methods and instance variables.</li>
</ul></li>
<li>Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include `MAX_OVERFLOW` and `TOTAL`.</li>
</ul>

<p>
## Mallecious
</p>

<p>
Update Spyder: <code>pip install -U spyder</code>
</p>

<p>
An environment for Python 3.5 installed along with Python 2 by
</p>

<div class="org-src-container">
<pre class="src src-shell">    conda create -n py35 <span style="color: #6a1868;">python</span>=3.5 anaconda
</pre>
</div>

<p>
To activate this environment, type `source activate py35`; to deactivate, use `source deactivate`.
The enviroment path is on <b>/startrek/chongchong/anaconda2/envs/py35/bin/python</b>.
</p>
</div>
</div>

<div id="outline-container-orga353a55" class="outline-4">
<h4 id="orga353a55">MPI4PY</h4>
<div class="outline-text-4" id="text-orga353a55">
</div>
<div id="outline-container-org700882e" class="outline-5">
<h5 id="org700882e">Solution to a problem</h5>
<div class="outline-text-5" id="text-org700882e">
<p>
<a href="https://stackoverflow.com/questions/44573568/mpirun-doesnt-work-and-ask-to-change-tmpdir-variable-to-tmp">https://stackoverflow.com/questions/44573568/mpirun-doesnt-work-and-ask-to-change-tmpdir-variable-to-tmp</a>
</p>

<div class="org-src-container">
<pre class="src src-shell">   <span style="color: #a626a4;">export</span> <span style="color: #6a1868;">TMPDIR</span>=/tmp
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org8178acd" class="outline-3">
<h3 id="org8178acd">Plotting</h3>
<div class="outline-text-3" id="text-org8178acd">
</div>
<div id="outline-container-org0dd09c0" class="outline-4">
<h4 id="org0dd09c0">plotutils.py</h4>
<div class="outline-text-4" id="text-org0dd09c0">
</div>
<div id="outline-container-org4587b65" class="outline-5">
<h5 id="org4587b65">What does it do?</h5>
<div class="outline-text-5" id="text-org4587b65">
<ul class="org-ul">
<li>Set figure size to make the lines and texts larger</li>
<li>Set font size, including texts, ticks, etc</li>
<li>Useful function like set_plot_style, sized_figure_new, etc</li>
</ul>
</div>
</div>

<div id="outline-container-orgeafb463" class="outline-5">
<h5 id="orgeafb463">How to use?</h5>
<div class="outline-text-5" id="text-orgeafb463">
<ul class="org-ul">
<li><code>import plotutils</code></li>
<li>Use the following methods to enable latex and serif style
<ul class="org-ul">
<li><code>pu.set_plot_style(0)</code></li>
<li>Put a <code>-l</code> in argv, e.g. <code>python main.py -l</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
