files/wiki/org/programming.org
*** color palettes (in Seaborn)

  https://chrisalbon.com/python/data_visualization/seaborn_color_palettes/

*** SciencePlot

  #+BEGIN_SRC python
    with plt.style.context(['science']):
        fig, ax = plt.subplots()
        for p in [10, 15, 20, 30, 50, 100]:
            ax.plot(x, model(x, p), label=p)
        ax.legend(title='Order')
        ax.set(xlabel=r'Voltage ($\frac{1}{mV}$)')
        ax.set(ylabel='Current ($\mu$A)')
        ax.set(title='this is title')
        ax.autoscale(tight=True)    # to auto set x and y lim
        fig.savefig('figures/fig-t1-autoscale.pdf')
  #+END_SRC

** Miscellaneous
*** Split pdf files

  from pdfsplit import *  # in a folder with pdfsplit.py
  pagenumbers = [3,4,1,2]
  slices = []

  for i in pagenumbers:
  slices.append(slice(i, i+1, None))

  path = file_path
  splitPages(path, slices)

** PyLint

*** Documentation
     - Docu: https://pylint.readthedocs.io/en/latest/
     - Tutorial: https://pylint.readthedocs.io/en/latest/tutorial.html
     - Naming:
       https://pylint.readthedocs.io/en/latest/user_guide/options.html

*** .pylintrc

     I have my own version of .pylintrc in ~/

** Cython

*** Example: primes.pyx
     See ~/Documents/projects/Python/cython/eg_prime
**** Steps
     1. Write primes.pyx
     2. Write setup.py
     3. Compile with ~python setup.py build_ext --inplace~
     4. In python, do
     #+BEGIN_SRC python
     import primes
     primes.primes(10)
     #+END_SRC

** iPython tricks

Autoreload module

#+BEGIN_SRC python
%load_ext autoreload
%autoreload 2
from foo import some_function
some_function()
# Do some edit to foo.py
some_function()
#+END_SRC

** Jupyter

*** Configurations

  - [[http://christopherroach.com/articles/jupyterlab-desktop-app/][Running Jupyter Lab as a Desktop Application]] ([[file:/Users/chongchonghe/Documents/computer/local-html-bk/Running_Jupyter_Lab_as_a_Desktop_Application.html][local]])

  - vim mode: I have installed jwkvam/jupyterlab-vim on macOS and startrek.

  - Table of contents: Installed jupyterlab/jupyterlab-toc on macOS and startrek.

*** Tips

**** Shortcuts

  ~Shift-Cmd '~: switch to previously used tab

*** Edit python notebooks over SSH

Source:
- [[https://fizzylogic.nl/2017/11/06/edit-jupyter-notebooks-over-ssh/][5 easy steps to start editing python notebooks over SSH - Willem's Fizzy Logic]]
- Open jupyter as application: http://christopherroach.com/articles/jupyterlab-desktop-app/

**** Quick steps

***** Method 1

  1. Start a jupyter server on startrek with host 8088 (not via ssh):

      #+BEGIN_SRC
      startrek >>> jln
      #+END_SRC

  2. On my macOS, do ~jlst2~, which will setup a SSH tunnel to startrek
     and open a localhost in browser.

***** Method 2

  On my macOS, do ~jlst~ in one terminal, which will start a jupyter
  notebook on startrek via ssh, then ~jlst2~ in another terminal.

**** Steps

1. Start jupyter notebook editor on server (via ssh): (~--ip=0.0.0.0~ is necessary)

#+BEGIN_EXAMPLE
nohup jupyter notebook --no-browser --ip=0.0.0.0 --port=8088 &
#+END_EXAMPLE

2. Setup a SSH tunnel to your server (short: ~jlconnect 8088~):

#+BEGIN_EXAMPLE
ssh -NL 8088:localhost:8088 <remote_user>@<remote_host>
#+END_EXAMPLE

3. Open the notebook in your browser (short: ~jlopen 8088~):

#+BEGIN_EXAMPLE
open http://localhost:8089/lab
#+END_EXAMPLE

I have set a password on st, which is stored in lastpass.

*** Add kernel to jupyter

Source: [[https://janakiev.com/blog/jupyter-virtual-envs/][Using Virtual Environments in Jupyter Notebook and Python - Parametric Thoughts]]

On base Python:
#+BEGIN_SRC sh
pip install --user ipykernel
#+END_SRC

Add your virtual environment to Jupyter
#+BEGIN_SRC sh
python -m ipykernel install --user --name=myenv
#+END_SRC

** Web

