files/wiki/public/programming.html

<div id="outline-container-org808fc6c" class="outline-4">
<h4 id="org808fc6c">color palettes (in Seaborn)</h4>
<div class="outline-text-4" id="text-org808fc6c">
<p>
<a href="https://chrisalbon.com/python/data_visualization/seaborn_color_palettes/">https://chrisalbon.com/python/data_visualization/seaborn_color_palettes/</a>
</p>
</div>
</div>

<div id="outline-container-orga68a4d2" class="outline-4">
<h4 id="orga68a4d2">SciencePlot</h4>
<div class="outline-text-4" id="text-orga68a4d2">
<div class="org-src-container">
<pre class="src src-python"><span style="background-color: #f0f0f0;"> </span>   <span style="color: #e45649;">with</span> plt.style.context([<span style="color: #50a14f;">'science'</span>]):
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   <span style="color: #6a1868;">fig</span>, <span style="color: #6a1868;">ax</span> = plt.subplots()
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   <span style="color: #e45649;">for</span> p <span style="color: #e45649;">in</span> [10, 15, 20, 30, 50, 100]:
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.plot(x, model(x, p), label=p)
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.legend(title=<span style="color: #50a14f;">'Order'</span>)
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.<span style="color: #a626a4;">set</span>(xlabel=r<span style="color: #50a14f;">'Voltage ($\frac{1}{mV}$)'</span>)
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.<span style="color: #a626a4;">set</span>(ylabel=<span style="color: #50a14f;">'Current ($\mu$A)'</span>)
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.<span style="color: #a626a4;">set</span>(title=<span style="color: #50a14f;">'this is title'</span>)
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   ax.autoscale(tight=<span style="color: #b751b6;">True</span>)    <span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">to auto set x and y lim</span>
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>   fig.savefig(<span style="color: #50a14f;">'figures/fig-t1-autoscale.pdf'</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org047f6e8" class="outline-3">
<h3 id="org047f6e8">Miscellaneous</h3>
<div class="outline-text-3" id="text-org047f6e8">
</div>
<div id="outline-container-orgb082cf5" class="outline-4">
<h4 id="orgb082cf5">Split pdf files</h4>
<div class="outline-text-4" id="text-orgb082cf5">
<p>
from pdfsplit import *  # in a folder with pdfsplit.py
pagenumbers = [3,4,1,2]
slices = []
</p>

<p>
for i in pagenumbers:
slices.append(slice(i, i+1, None))
</p>

<p>
path = file_path
splitPages(path, slices)
</p>
</div>
</div>
</div>

<div id="outline-container-org5e52cde" class="outline-3">
<h3 id="org5e52cde">PyLint</h3>
<div class="outline-text-3" id="text-org5e52cde">
</div>
<div id="outline-container-orgea939b7" class="outline-4">
<h4 id="orgea939b7">Documentation</h4>
<div class="outline-text-4" id="text-orgea939b7">
<ul class="org-ul">
<li>Docu: <a href="https://pylint.readthedocs.io/en/latest/">https://pylint.readthedocs.io/en/latest/</a></li>
<li>Tutorial: <a href="https://pylint.readthedocs.io/en/latest/tutorial.html">https://pylint.readthedocs.io/en/latest/tutorial.html</a></li>
<li>Naming:
<a href="https://pylint.readthedocs.io/en/latest/user_guide/options.html">https://pylint.readthedocs.io/en/latest/user_guide/options.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org89da05a" class="outline-4">
<h4 id="org89da05a">.pylintrc</h4>
<div class="outline-text-4" id="text-org89da05a">
<p>
I have my own version of .pylintrc in ~/
</p>
</div>
</div>
</div>

<div id="outline-container-org80fe79f" class="outline-3">
<h3 id="org80fe79f">Cython</h3>
<div class="outline-text-3" id="text-org80fe79f">
</div>
<div id="outline-container-orgb74238a" class="outline-4">
<h4 id="orgb74238a">Example: primes.pyx</h4>
<div class="outline-text-4" id="text-orgb74238a">
<p>
See ~/Documents/projects/Python/cython/eg_prime
</p>
</div>
<div id="outline-container-org82b6800" class="outline-5">
<h5 id="org82b6800">Steps</h5>
<div class="outline-text-5" id="text-org82b6800">
<ol class="org-ol">
<li>Write primes.pyx</li>
<li>Write setup.py</li>
<li>Compile with <code>python setup.py build_ext --inplace</code></li>
<li>In python, do</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span><span style="color: #e45649;">import</span> primes
<span style="background-color: #f0f0f0;"> </span>   <span style="background-color: #f0f0f0;"> </span>primes.primes(10)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org3ad6308" class="outline-3">
<h3 id="org3ad6308">iPython tricks</h3>
<div class="outline-text-3" id="text-org3ad6308">
<p>
Autoreload module
</p>

<div class="org-src-container">
<pre class="src src-python">%load_ext autoreload
%autoreload 2
<span style="color: #e45649;">from</span> foo <span style="color: #e45649;">import</span> some_function
some_function()
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">Do some edit to foo.py</span>
some_function()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadbc810" class="outline-3">
<h3 id="orgadbc810">Jupyter</h3>
<div class="outline-text-3" id="text-orgadbc810">
</div>
<div id="outline-container-org7125789" class="outline-4">
<h4 id="org7125789">Configurations</h4>
<div class="outline-text-4" id="text-org7125789">
<ul class="org-ul">
<li><a href="http://christopherroach.com/articles/jupyterlab-desktop-app/">Running Jupyter Lab as a Desktop Application</a> (<a href="file:///Users/chongchonghe/Documents/computer/local-html-bk/Running_Jupyter_Lab_as_a_Desktop_Application.html">local</a>)</li>

<li>vim mode: I have installed jwkvam/jupyterlab-vim on macOS and startrek.</li>

<li>Table of contents: Installed jupyterlab/jupyterlab-toc on macOS and startrek.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2bee6b" class="outline-4">
<h4 id="orgb2bee6b">Tips</h4>
<div class="outline-text-4" id="text-orgb2bee6b">
</div>
<div id="outline-container-org8ff61a6" class="outline-5">
<h5 id="org8ff61a6">Shortcuts</h5>
<div class="outline-text-5" id="text-org8ff61a6">
<p>
<code>Shift-Cmd '</code>: switch to previously used tab
</p>
</div>
</div>
</div>

<div id="outline-container-org9473ab4" class="outline-4">
<h4 id="org9473ab4">Edit python notebooks over SSH</h4>
<div class="outline-text-4" id="text-org9473ab4">
<p>
Source:
</p>
<ul class="org-ul">
<li><a href="https://fizzylogic.nl/2017/11/06/edit-jupyter-notebooks-over-ssh/">5 easy steps to start editing python notebooks over SSH - Willem's Fizzy Logic</a></li>
<li>Open jupyter as application: <a href="http://christopherroach.com/articles/jupyterlab-desktop-app/">http://christopherroach.com/articles/jupyterlab-desktop-app/</a></li>
</ul>
</div>

<div id="outline-container-orgab7ff0b" class="outline-5">
<h5 id="orgab7ff0b">Quick steps</h5>
<div class="outline-text-5" id="text-orgab7ff0b">
</div>
<ul class="org-ul">
<li><a id="orgdb63377"></a>Method 1<br />
<div class="outline-text-6" id="text-orgdb63377">
<ol class="org-ol">
<li><p>
Start a jupyter server on startrek with host 8088 (not via ssh):
</p>

<pre class="example">
      startrek &gt;&gt;&gt; jln
</pre></li>

<li>On my macOS, do <code>jlst2</code>, which will setup a SSH tunnel to startrek
and open a localhost in browser.</li>
</ol>
</div>
</li>

<li><a id="orgb14d4e2"></a>Method 2<br />
<div class="outline-text-6" id="text-orgb14d4e2">
<p>
On my macOS, do <code>jlst</code> in one terminal, which will start a jupyter
notebook on startrek via ssh, then <code>jlst2</code> in another terminal.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8a9ac0d" class="outline-5">
<h5 id="org8a9ac0d">Steps</h5>
<div class="outline-text-5" id="text-org8a9ac0d">
<ol class="org-ol">
<li>Start jupyter notebook editor on server (via ssh): (<code>--ip=0.0.0.0</code> is necessary)</li>
</ol>

<pre class="example" id="org7873288">
nohup jupyter notebook --no-browser --ip=0.0.0.0 --port=8088 &amp;
</pre>

<ol class="org-ol">
<li>Setup a SSH tunnel to your server (short: <code>jlconnect 8088</code>):</li>
</ol>

<pre class="example" id="org5915ebb">
ssh -NL 8088:localhost:8088 &lt;remote_user&gt;@&lt;remote_host&gt;
</pre>

<ol class="org-ol">
<li>Open the notebook in your browser (short: <code>jlopen 8088</code>):</li>
</ol>

<pre class="example" id="orgfb00ffc">
open http://localhost:8089/lab
</pre>

<p>
I have set a password on st, which is stored in lastpass.
</p>
</div>
</div>
</div>

<div id="outline-container-org52b95b9" class="outline-4">
<h4 id="org52b95b9">Add kernel to jupyter</h4>
<div class="outline-text-4" id="text-org52b95b9">
<p>
Source: <a href="https://janakiev.com/blog/jupyter-virtual-envs/">Using Virtual Environments in Jupyter Notebook and Python - Parametric Thoughts</a>
</p>

<p>
On base Python:
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install --user ipykernel
</pre>
</div>

<p>
Add your virtual environment to Jupyter
</p>
<div class="org-src-container">
<pre class="src src-sh">python -m ipykernel install --user --name=myenv
</pre>
</div>
</div>
</div>
</div>
