files/wiki/org/programming.org
*** Downloading files from web using Python

Using ~wget~:
#+BEGIN_SRC sh
wget img-url
# or
wget img-url --referer=img-url
#+END_SRC

Using ~requests~:
#+begin_src python :results file :export both :cache no
# imported the requests library 
import requests 
image_url = "https://www.python.org/static/community_logos/python-logo-master-v3-TM.png"
  
# URL of the image to be downloaded is defined as image_url 
r = requests.get(image_url) # create HTTP response object 
  
with open("python_logo.png",'wb') as f: 
    # write the contents of the response (r.content) 
    # to a new file in binary mode. 
    f.write(r.content) 
#+end_src

** Logging

*** Try logging into file

#+begin_src python :results file :export both :cache no
flogger = tools.getlog(__name__, "info")
# flogger.propagate = False
fileHandler = logging.FileHandler('parameters.log', mode='a')
fileHandler.setLevel(logging.INFO)
flogger.addHandler(fileHandler)
flogger.info("\n")
formatter = logging.Formatter('%(asctime)s %(name)s: %(message)s')
fileHandler.setFormatter(formatter)

flooger.info("log message")
#+end_src

