files/wiki/public/programming.html

<div id="outline-container-orgd5d757d" class="outline-3">
<h3 id="orgd5d757d">Web</h3>
<div class="outline-text-3" id="text-orgd5d757d">
</div>
<div id="outline-container-org2512325" class="outline-4">
<h4 id="org2512325">Downloading files from web using Python</h4>
<div class="outline-text-4" id="text-org2512325">
<p>
Using <code>wget</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">wget img-url
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">or</span>
wget img-url --referer=img-url
</pre>
</div>

<p>
Using <code>requests</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">imported the requests library </span>
<span style="color: #e45649;">import</span> requests 
<span style="color: #6a1868;">image_url</span> = <span style="color: #50a14f;">"https://www.python.org/static/community_logos/python-logo-master-v3</span><span style="color: #e45649; background-color: #f0f0f0; font-weight: bold;">-TM.png"</span>
<span style="background-color: #f0f0f0;"> </span> 
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">URL of the image to be downloaded is defined as image_url </span>
<span style="color: #6a1868;">r</span> = requests.get(image_url) <span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">create HTTP response object </span>
<span style="background-color: #f0f0f0;"> </span> 
<span style="color: #e45649;">with</span> <span style="color: #a626a4;">open</span>(<span style="color: #50a14f;">"python_logo.png"</span>,<span style="color: #50a14f;">'wb'</span>) <span style="color: #e45649;">as</span> f: 
<span style="background-color: #f0f0f0;"> </span>   <span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">write the contents of the response (r.content) </span>
<span style="background-color: #f0f0f0;"> </span>   <span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">to a new file in binary mode. </span>
<span style="background-color: #f0f0f0;"> </span>   f.write(r.content) 
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0853eec" class="outline-3">
<h3 id="org0853eec">Logging</h3>
<div class="outline-text-3" id="text-org0853eec">
</div>
<div id="outline-container-orgb7016a2" class="outline-4">
<h4 id="orgb7016a2">Try logging into file</h4>
<div class="outline-text-4" id="text-orgb7016a2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6a1868;">flogger</span> = tools.getlog(<span style="color: #a626a4;">__name__</span>, <span style="color: #50a14f;">"info"</span>)
<span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">flogger.propagate = False</span>
<span style="color: #6a1868;">fileHandler</span> = logging.FileHandler(<span style="color: #50a14f;">'parameters.log'</span>, mode=<span style="color: #50a14f;">'a'</span>)
fileHandler.setLevel(logging.INFO)
flogger.addHandler(fileHandler)
flogger.info(<span style="color: #50a14f;">"\n"</span>)
<span style="color: #6a1868;">formatter</span> = logging.Formatter(<span style="color: #50a14f;">'%(asctime)s %(name)s: %(message)s'</span>)
fileHandler.setFormatter(formatter)

flooger.info(<span style="color: #50a14f;">"log message"</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Author: ChongChong He</p><p></p><p><a href='https://www.astro.umd.edu/~chongchong/'>www.astro.umd.edu/~chongchong/</a></p>
</div>
</body>
</html>